FELIPACK_PROMPT = '''<δικα μας προΙοντα>
Κωδικός	Όνομα
FEL-B-10	Φελιζόλ για Ψεύτικες τούρτες - Σχήμα Μπάλας Φ10
FEL-B-12	Φελιζόλ για Ψεύτικες τούρτες - Σχήμα Μπάλας Φ12
FEL-B-15	Φελιζόλ για Ψεύτικες τούρτες - Σχήμα Μπάλας Φ15
FEL-B-2	Φελιζόλ για Ψεύτικες τούρτες - Σχήμα Μπάλας Φ2
FEL-B-20	Φελιζόλ για Ψεύτικες τούρτες - Σχήμα Μπάλας Φ20
FEL-B-3	Φελιζόλ για Ψεύτικες τούρτες - Σχήμα Μπάλας Φ3
FEL-B-4	Φελιζόλ για Ψεύτικες τούρτες - Σχήμα Μπάλας Φ4
FEL-B-5	Φελιζόλ για Ψεύτικες τούρτες - Σχήμα Μπάλας Φ5
FEL-B-6	Φελιζόλ για Ψεύτικες τούρτες - Σχήμα Μπάλας Φ6
FEL-B-8	Φελιζόλ για Ψεύτικες τούρτες - Σχήμα Μπάλας Φ8
FEL-C-0815	Φελιζόλ για Ψεύτικες τούρτες - Κώνος -Φ08xY15εκ
FEL-C-2030	Φελιζόλ για Ψεύτικες τούρτες - Κώνος -Φ20xY30εκ
FEL-C-2260	Φελιζόλ για Ψεύτικες τούρτες - Κώνος -Φ22xY60εκ
FEL-C-2540	Φελιζόλ για Ψεύτικες τούρτες - Κώνος -O25xY40εκ
FEL-CM-001	Φελιζόλ για Ψεύτικες τούρτες - Σχήμα κατά παραγγελία
FEL-EGG-D11H10	Φελιζόλ σε σχήμα αυγού Φ11xY10εκ
FEL-EGG-D14H13	Φελιζόλ σε σχήμα αυγού Φ14xY13εκ
FEL-EGG-D17H16	Φελιζόλ σε σχήμα αυγού Φ17xY16εκ
FEL-HB-10	Φελιζόλ για Ψεύτικες τούρτες - Ημισφαίριο Φ10
FEL-HB-12	Φελιζόλ για Ψεύτικες τούρτες - Ημισφαίριο Φ12
FEL-HB-15	Φελιζόλ για Ψεύτικες τούρτες - Ημισφαίριο  Φ15
FEL-HB-18720	Φελιζόλ για ψεύτικες τούρτες - Σχήμα φούστας 07-20χΥ18
FEL-HB-20	Φελιζόλ για Ψεύτικες τούρτες - Ημισφαίριο  Φ20
FEL-HB-6	Φελιζόλ για Ψεύτικες τούρτες - Ημισφαίριο Φ6
FEL-HB-8	Φελιζόλ για Ψεύτικες τούρτες - Ημισφαίριο Φ8
FEL-P-253507	Φελιζόλ για Ψεύτικες τούρτες - Παραλληλόγραμμο 25x35xY07εκ
FEL-P-302007	Φελιζόλ για Ψεύτικες τούρτες - Παραλληλόγραμμο 30x20xY07εκ
FEL-PIL-1510	Φελιζόλ σε σχήμα Μαξιλάρι - Μ15εκ x Υ10εκ.
FEL-PIL-2010	Φελιζόλ σε σχήμα Μαξιλάρι - Μ20εκ x Υ10εκ.
FEL-PIL-2510	Φελιζόλ σε σχήμα Μαξιλάρι - Μ25εκ x Υ10εκ.
FEL-PIL-3010	Φελιζόλ σε σχήμα Μαξιλάρι - Μ30εκ x Υ10εκ.
FEL-PIL-3510	Φελιζόλ σε σχήμα Μαξιλάρι - Μ35εκ x Υ10εκ.
FEL-R-0615	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ06xY15εκ
FEL-R-1005	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ10xY5εκ.
FEL-R-1007	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ10xY7εκ.
FEL-R-1010	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ10xY10εκ.
FEL-R-1012	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ10xY12εκ
FEL-R-1015	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ10xY15εκ
FEL-R-1205	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ12xY05εκ
FEL-R-1207	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ12xY07εκ
FEL-R-1210	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ12xY10εκ
FEL-R-1212	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ12xY12εκ
FEL-R-1215	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ12xY15εκ
FEL-R-1505	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ15xY05εκ
FEL-R-1507	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ15xY07εκ
FEL-R-1510	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ15xY10εκ
FEL-R-1512	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ15xY12εκ
FEL-R-1515	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ15xY15εκ
FEL-R-1520	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ15xY20εκ
FEL-R-1805	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ18xY05εκ
FEL-R-1807	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ18xY07εκ
FEL-R-1810	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ18xY10εκ
FEL-R-1812	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ18xY12εκ
FEL-R-1815	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ18xY15εκ
FEL-R-1820	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ18xY20εκ
FEL-R-2005	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ20xY05εκ
FEL-R-2007	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ20xY07εκ
FEL-R-2010	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ20xY10εκ
FEL-R-2012	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ20xY12εκ
FEL-R-2015	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ20xY15εκ
FEL-R-2020	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ20xY20εκ
FEL-R-2205	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ22xY05εκ
FEL-R-2207	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ22xY07εκ
FEL-R-2210	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ22xY10εκ
FEL-R-2212	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ22xY12εκ
FEL-R-2215	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ22xY15εκ
FEL-R-2220	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ22xY20εκ
FEL-R-2505	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ25xY05εκ
FEL-R-2507	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ25xY07εκ
FEL-R-2510	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ25xY10εκ
FEL-R-2512	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ25xY12εκ
FEL-R-2515	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ25xY15εκ
FEL-R-2520	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ25xY20εκ
FEL-R-2805	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ28xY05εκ
FEL-R-2807	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ28xY07εκ
FEL-R-2810	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ28xY10εκ
FEL-R-2812	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ28xY12εκ
FEL-R-2815	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ28xY15εκ
FEL-R-2820	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ28xY20εκ
FEL-R-3005	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ30xY05εκ
FEL-R-3007	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ30xY07εκ
FEL-R-3010	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ30xY10εκ
FEL-R-3012	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ30xY12εκ
FEL-R-3015	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ30xY15εκ
FEL-R-3020	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ30xY20εκ
FEL-R-3205	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ32xY05εκ
FEL-R-3207	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ32xY07εκ
FEL-R-3210	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ32xY10εκ
FEL-R-3212	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ32xY12εκ
FEL-R-3215	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ32xY15εκ
FEL-R-3505	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ35xY05εκ
FEL-R-3507	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ35xY07εκ
FEL-R-3510	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ35xY10εκ
FEL-R-3512	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ35xY12εκ
FEL-R-3515	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ35xY15εκ
FEL-R-3807	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ38xY07εκ
FEL-R-3810	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ38xY10εκ
FEL-R-3812	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ38xY12εκ
FEL-R-3815	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ38xY15εκ
FEL-R-4005	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ40xY05εκ
FEL-R-4007	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ40xY07εκ
FEL-R-4010	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ40xY10εκ
FEL-R-4012	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ40xY12εκ
FEL-R-4015	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ40xY15εκ
FEL-R-4210	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ42xY10εκ
FEL-R-4510	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ45xY10εκ
FEL-R-4512	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ45xY12εκ
FEL-R-5010	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ50xY10εκ
FEL-R-5012	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ50xY12εκ
FEL-R-5015	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ50xY15εκ
FEL-R-6010	Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ60xY10εκ
FEL-S-1210	Φελιζόλ για Ψεύτικες τούρτες - Τετράγωνο 12x12xY10εκ
FEL-S-1510	Φελιζόλ για Ψεύτικες τούρτες - Τετράγωνο 15x15xY10εκ
FEL-S-1515	Φελιζόλ για Ψεύτικες τούρτες - Τετράγωνο 15x15xY15εκ
FEL-S-1810	Φελιζόλ για Ψεύτικες τούρτες - Τετράγωνο 18x18xY10εκ
FEL-S-1812	Φελιζόλ για Ψεύτικες τούρτες - Τετράγωνο 18x18xY12εκ
FEL-S-1815	Φελιζόλ για Ψεύτικες τούρτες - Τετράγωνο 18x18xY15εκ
FEL-S-2007	Φελιζόλ για Ψεύτικες τούρτες - Τετράγωνο 20x20xY07εκ
FEL-S-2010	Φελιζόλ για Ψεύτικες τούρτες - Τετράγωνο 20x20xY10εκ
FEL-S-2012	Φελιζόλ για Ψεύτικες τούρτες - Τετράγωνο 20x20xY12εκ
FEL-S-2020	Φελιζόλ για Ψεύτικες τούρτες - Τετράγωνο 20x20xY20εκ
FEL-S-2210	Φελιζόλ για Ψεύτικες τούρτες - Τετράγωνο 22x22xY10εκ
FEL-S-2215	Φελιζόλ για Ψεύτικες τούρτες - Τετράγωνο 22x22xY15εκ
FEL-S-2505	Φελιζόλ για Ψεύτικες τούρτες - Τετράγωνο 25x25xY5εκ
FEL-S-2510	Φελιζόλ για Ψεύτικες τούρτες - Τετράγωνο 25x25xY10εκ
FEL-S-2525	Φελιζόλ για Ψεύτικες τούρτες - Κύβος 25x25xY25εκ
FEL-S-2807	Φελιζόλ για Ψεύτικες τούρτες - Τετράγωνο 28x28xY07εκ
FEL-S-2810	Φελιζόλ για Ψεύτικες τούρτες - Τετράγωνο 28x28xY10εκ
FEL-S-3005	Φελιζόλ για Ψεύτικες τούρτες - Τετράγωνο 30x30xY5εκ
FEL-S-3007	Φελιζόλ για Ψεύτικες τούρτες - Τετράγωνο 30x30xY07εκ
FEL-S-3010	Φελιζόλ για Ψεύτικες τούρτες - Τετράγωνο 30x30xY10εκ
FEL-S-3015	Φελιζόλ για Ψεύτικες τούρτες - Τετράγωνο 30x30xY15εκ
FEL-S-3210	Φελιζόλ για Ψεύτικες τούρτες - Τετράγωνο 32x32xY10εκ
FEL-S-3505	Φελιζόλ για Ψεύτικες τούρτες - Τετράγωνο 35x35xY05εκ
FEL-S-3507	Φελιζόλ για Ψεύτικες τούρτες - Τετράγωνο 35x35xY07εκ
FEL-S-3510	Φελιζόλ για Ψεύτικες τούρτες - Τετράγωνο 35x35xY10εκ
FEL-S-4010	Φελιζόλ για Ψεύτικες τούρτες - Τετράγωνο 40x40xY10εκ
FEL-S-4012	Φελιζόλ για Ψεύτικες τούρτες - Τετράγωνο 40x40xY12εκ
FEL-S-4015	Φελιζόλ για Ψεύτικες τούρτες - Τετράγωνο 40x40xY15εκ
FEL-S-4510	Φελιζόλ για Ψεύτικες τούρτες - Τετράγωνο 45x45xY10εκ
FEL-S-5010	Φελιζόλ για Ψεύτικες τούρτες - Τετράγωνο 50x50xY10εκ
</δικα μας προΙοντα>

Θα σου δινω pdf με τιμολογιο και θέλω να μου επιστρεφεις ενα JSON( δεκαδικα με κομα).

1. Θα κανεις αντισοτιχηση των κωδικων με τα διμα μας προιοντα
2. θα διαιρεις την στηλη του pdf ΚΑΘΑΡΗ ΑΞΙΑ με την στηλη της ΠΟΣΟΤΗΤΑ και θα το ονομασουμε ΤΕΛΙΚΗ ΤΙΜΗ
3. ΘΑ φτιαχνει json μεσα σε tags <json></json> την εξης μορφη Συμαντικο! Η τελική τιμή πάντα με κόμα : 
<Fortmat>
{"Κωδικός":"κωδικος", "Όνομα":"όνομα", "Ποσότητα": 10 , "Τελική Τιμή": 0.80},{"Κωδικός":"κωδικος2", "Όνομα":"όνομα2", "Ποσότητα": 5 , "Τελική Τιμή": 0.35}
</Format>
θα γραφεις αναλυτικα oλη την διαδικασια και κυριως το βημα 2

Παράδειγμα 1
Α/α ΚΩΔΙΚΟΣ ΠΕΡΙΓΡΑΦΗ ΕΙΔΟΥΣ ΜΜ ΠΟΣΟΤΗΤΑ ΤΙΜΗ % ΕΚΠΤ. ΕΚΠΤΩΣΕΙΣ ΚΑΘΑΡΗ ΑΞΙΑ % ΦΠΑ
1 CYL022020 ΚΥΛΙΝΔΡΟΣ ΔΙΑΜΕΤΡΟΥ 22CM ΥΨΟΥΣ 20CM ΤΕΜ 10,000 1,650 10,000 1,65 14,85 24 
Η πληροφορεια παραπανω θα γίνει τελικα {"Κωδικός":FEL-R-2220", "Όνομα":"Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ22xY20εκ", "Ποσότητα": 10 , "Τελική Τιμή": 1.458}
Α/α ΚΩΔΙΚΟΣ ΠΕΡΙΓΡΑΦΗ ΕΙΔΟΥΣ ΜΜ ΠΟΣΟΤΗΤΑ ΤΙΜΗ % ΕΚΠΤ. ΕΚΠΤΩΣΕΙΣ ΚΑΘΑΡΗ ΑΞΙΑ % ΦΠΑ
1 CYL020010 ΚΥΛΙΝΔΡΟΣ ΔΙΑΜΕΤΡΟΥ 20CM ΥΨΟΥΣ 10CM ΤΕΜ 15,000 0,800 10,000 1,20 10,80 24
2 CYL020015 ΚΥΛΙΝΔΡΟΣ ΔΙΑΜΕΤΡΟΥ 20CM ΥΨΟΥΣ 15CM ΤΕΜ 10,000 1,200 10,000 1,20 10,80 24
{"Κωδικός":"FEL-R-2010", "Όνομα":"Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ20xY10εκ", "Ποσότητα":10 , "Τελική Τιμή": 0.72 },{"Κωδικός":"FEL-R-2015", "Όνομα":"Φελιζόλ για Ψεύτικες τούρτες - Στρογγυλό Φ20xY15εκ", "Ποσότητα": 10 , "Τελική Τιμή": 1.08}
Α/α ΚΩΔΙΚΟΣ ΠΕΡΙΓΡΑΦΗ ΕΙΔΟΥΣ ΜΜ ΠΟΣΟΤΗΤΑ ΤΙΜΗ % ΕΚΠΤ. ΕΚΠΤΩΣΕΙΣ ΚΑΘΑΡΗ ΑΞΙΑ % ΦΠΑ
1 SQU015015 ΚΥΒΟΣ ΦΕΛΙΖΟΛ 15X15X15cm ΤΕΜ 4,000 0,500 10,000 0,20 1,80 24
Η πληροφορεια παραπανω θα γίνει τελικα {"Κωδικός":FEL-S-1515", "Όνομα":"Φελιζόλ για Ψεύτικες τούρτες - Τετράγωνο 15x15xY15εκ", "Ποσότητα": 4 , "Τελική Τιμή": 0.45}



'''